# TextNoteType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNoteType Class
Members See Also
---
An object that represents a text note style.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class TextNoteType : TextElementType
```

Visual Basic
---
```text
Public Class TextNoteType _
	Inherits TextElementType
```

Visual C++
---
```text
public ref class TextNoteType : public TextElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..LineAndTextAttrSymbol Autodesk.Revit.DB..::..TextElementType Autodesk.Revit.DB..::..TextNoteType
# See Also
TextNoteType Members
Autodesk.Revit.DB Namespace